In [2]:
import pandas as pd
import numpy as np

### pandas 의 Series는 1차원 데이터
### pandas 의 DataFrame은 2차원 데이터 (표)

In [3]:
s=pd.Series([1,2,3,4,5,6])

In [4]:
s

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [5]:
s.index
print(s.index)  #인덱스 값만 
print(s.values) #벨류 값만 보여주기

RangeIndex(start=0, stop=6, step=1)
[1 2 3 4 5 6]

In [6]:
s2=pd.Series([1,2,3,'a','b','c'])
s2

0    1
1    2
2    3
3    a
4    b
5    c
dtype: object

In [7]:
s3=pd.Series([np.nan,12,45,'a'])  # numpy 임포트 해서 넌 값 줄수 있다.
s3

0    NaN
1     12
2     45
3      a
dtype: object

In [8]:
s4=pd.Series([1,2,3,4], index=[10,'11',12,13])  #인덱스 값을 내가 직접 지정할수 있다, 주로 리스트 형태로 들어 온다. 
s4

10    1
11    2
12    3
13    4
dtype: int64

In [9]:
s5=pd.Series({'name':100,"age":40,"heigh":163})  # 딕셔너리 타임으로 입력하면 자동으로 인덱스와 벨류가 들어간다
s5

name     100
age       40
heigh    163
dtype: int64

In [10]:
#날짜 데이터 입력하기 : 날짜 자동생성가능
pd.date_range(start='2019/01/01',end='2019-01-07') #시작날짜 끝날짜.출력 형식은 모두 2020-01-01  형식임.

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [11]:
pd.date_range(start='2019-01-01',periods=7) # 끝날짜를 지정하지 않고 간격을 준다. 날짜 생성기간을 주는것임 7일동안.

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [12]:
pd.date_range(start='2020-08-23',periods=4,freq='2D') #freq는 날짜 출력의 간격을 주는 것. 이거는 2일씩 증가하는것

DatetimeIndex(['2020-08-23', '2020-08-25', '2020-08-27', '2020-08-29'], dtype='datetime64[ns]', freq='2D')

In [13]:
pd.date_range(start='2020-01-01',periods=4,freq='W') # 일요일 날짜만 출력

DatetimeIndex(['2020-01-05', '2020-01-12', '2020-01-19', '2020-01-26'], dtype='datetime64[ns]', freq='W-SUN')

In [14]:
pd.date_range(start='2020-01-01',periods=12,freq='2BM')  #2개월 간격 월말 기준

DatetimeIndex(['2020-01-31', '2020-03-31', '2020-05-29', '2020-07-31',
               '2020-09-30', '2020-11-30', '2021-01-29', '2021-03-31',
               '2021-05-31', '2021-07-30', '2021-09-30', '2021-11-30'],
              dtype='datetime64[ns]', freq='2BM')

In [15]:
pd.date_range(start='2020-01-01',periods=4,freq='QS')  #분기별 시작일 기준.

DatetimeIndex(['2020-01-01', '2020-04-01', '2020-07-01', '2020-10-01'], dtype='datetime64[ns]', freq='QS-JAN')

In [16]:
pd.date_range(start='2020-01-01',periods=3,freq='AS') #1년주기

DatetimeIndex(['2020-01-01', '2021-01-01', '2022-01-01'], dtype='datetime64[ns]', freq='AS-JAN')

In [17]:
#date_range로 시간 생성하기
pd.date_range(start='2019-01-01 08:00',periods=10,freq='H') #1시간 기준으로

DatetimeIndex(['2019-01-01 08:00:00', '2019-01-01 09:00:00',
               '2019-01-01 10:00:00', '2019-01-01 11:00:00',
               '2019-01-01 12:00:00', '2019-01-01 13:00:00',
               '2019-01-01 14:00:00', '2019-01-01 15:00:00',
               '2019-01-01 16:00:00', '2019-01-01 17:00:00'],
              dtype='datetime64[ns]', freq='H')

In [18]:
index_data=pd.date_range(start='2020-07-01',periods=5)  #날짜로 인덱스 설정하기 
s6=pd.Series([1,2,3,4,5],index=index_data)
s6

2020-07-01    1
2020-07-02    2
2020-07-03    3
2020-07-04    4
2020-07-05    5
Freq: D, dtype: int64

### DataFrame

In [19]:
# 데이터 프레임의 index는 세로축라벨, columns는 가로축라벨이다.

In [20]:
pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]]) #인덱스와 컬럼 명시 안하면 자동으로 0부터 들어간다.

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [21]:
#numpy 배열 데이터를 이용한 데이터프레임
data_list=np.array([[1,2,3],[4,5,6],[7,8,9]])
pd.DataFrame(data_list)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [22]:
data_list=np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]])  #인덱스랑 컬럼 모두 지정한것임. 
index_data=pd.date_range(start='2020-01-01',periods=4)
columns_list=['A','B','C']
pd.DataFrame(data_list,index=index_data,columns=columns_list)

             A   B   C
2020-01-01   1   2   3
2020-01-02   4   5   6
2020-01-03   7   8   9
2020-01-04  10  11  12

In [23]:
table_data={   #딕셔너리를 이용한 데이타프레임.
    '연도':[2015,2016,2016,2017,2017] ,
    "지사":['한국','한국','미국','한국','미국'],
    '고객 수':[200,250,450,300,500]
}
pd.DataFrame(table_data) #인덱스는 자동생성되었도 컬럼은 키 값이 들어갔다.

     연도  지사  고객 수
0  2015  한국   200
1  2016  한국   250
2  2016  미국   450
3  2017  한국   300
4  2017  미국   500

In [24]:
df=pd.DataFrame(table_data,columns=['지사','고객 수','연도']) #직접 칼럼 배열을 명시할수 있다.
df

   지사  고객 수    연도
0  한국   200  2015
1  한국   250  2016
2  미국   450  2016
3  한국   300  2017
4  미국   500  2017

In [25]:
df.index #인덱스 따로 출력

RangeIndex(start=0, stop=5, step=1)

In [26]:
df.columns #칼럼 따로 출력

Index(['지사', '고객 수', '연도'], dtype='object')

In [27]:
df.values #밸류만 따로 출력

array([['한국', 200, 2015],
       ['한국', 250, 2016],
       ['미국', 450, 2016],
       ['한국', 300, 2017],
       ['미국', 500, 2017]], dtype=object)

### Pandas 데이터 연산

In [28]:
s1=pd.Series([1,2,3,4,5])
s2=pd.Series([11,12,13,14,15])
s1+s2

0    12
1    14
2    16
3    18
4    20
dtype: int64

In [29]:
s2-s1

0    10
1    10
2    10
3    10
4    10
dtype: int64

In [30]:
s1*s2

0    11
1    24
2    39
3    56
4    75
dtype: int64

In [31]:
s1/s2

0    0.090909
1    0.166667
2    0.230769
3    0.285714
4    0.333333
dtype: float64

In [32]:
#판다스는 데이터 크키가 달라도 연살할수 있다. 연산할수 있는 항목만 진행한다.
s3=pd.Series([10,11,12,13])
s4=pd.Series([2,3,4])
s3+s4

0    12.0
1    14.0
2    16.0
3     NaN
dtype: float64

In [33]:
s3=pd.Series([10,11,12,13])
s4=pd.Series([2,3,4])
s3+s4

0    12.0
1    14.0
2    16.0
3     NaN
dtype: float64

In [34]:
s3=pd.Series([10,11,12,13])
#s4=pd.Series([2,'3',4]) #문자열 끼면 연산이 아예 안돼서 에러발생
s3+s4

0    12.0
1    14.0
2    16.0
3     NaN
dtype: float64

In [35]:
table_data1={'A':[1,2,3,4,5],
            'B':[10,20,30,40,50],
            'C':[100,200,300,400,500]
            }
df1=pd.DataFrame(table_data1)


table_data2={'A':[6,7,8],
            'B':[60,70,80],
            'C':[600,700,800]
            }
df2=pd.DataFrame(table_data2)
print(df1)
print()
print(df2)

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800

In [36]:
df1+df2   #길이가 같지 않은 데이터를 더하면 nan이 나온다.

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

In [41]:
# 판다스 통계분석 메소드 : 계절별 강수량
table_data3 = {'봄':  [256.5, 264.3, 215.9, 223.2, 312.8],
              '여름': [770.6, 567.5, 599.8, 387.1, 446.2],
              '가을': [363.5, 231.2, 293.1, 247.7, 381.6],
              '겨울': [139.3, 59.9, 76.9, 109.1, 108.1]}
columns_list = ['봄', '여름', '가을', '겨울']
index_list = ['2012', '2013', '2014', '2015', '2016']

In [42]:
df3=pd.DataFrame(table_data3, index=index_list, columns=columns_list)
df3

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [43]:
df3.mean()  #칼럼 별 각 평균

봄     254.54
여름    554.24
가을    303.42
겨울     98.66
dtype: float64

In [44]:
df3.std()  #표준편차

봄      38.628267
여름    148.888895
가을     67.358496
겨울     30.925523
dtype: float64

In [47]:
# 연산의 방향 설정하기  :axis 사용하자!!!. axis=0(default) :밸류에서 열별로 연산 axis=1 : 행별로 연산 
df3.mean(axis=1)   #행별로 연산

2012    382.475
2013    280.725
2014    296.425
2015    241.775
2016    312.175
dtype: float64

In [49]:
df3.std(axis=1)

2012    274.472128
2013    211.128782
2014    221.150739
2015    114.166760
2016    146.548658
dtype: float64

In [52]:
df3.describe()  # 평균, 표준편차, 최소/대 값등 한번에 구하는 방법.

                봄          여름          가을          겨울
count    5.000000    5.000000    5.000000    5.000000
mean   254.540000  554.240000  303.420000   98.660000
std     38.628267  148.888895   67.358496   30.925523
min    215.900000  387.100000  231.200000   59.900000
25%    223.200000  446.200000  247.700000   76.900000
50%    256.500000  567.500000  293.100000  108.100000
75%    264.300000  599.800000  363.500000  109.100000
max    312.800000  770.600000  381.600000  139.300000

#### 데이터를 원하는 대로 선택하기 
- 원하는 데이터만 선택하기.
- 원본 훼손없이 원하는 부분만 선택하는 방법.

In [53]:
KTX_data = {'경부선 KTX': [39060, 39896, 42005, 43621, 41702, 41266, 32427],
            '호남선 KTX': [7313, 6967, 6873, 6626, 8675, 10622, 9228],
            '경전선 KTX': [3627, 4168, 4088, 4424, 4606, 4984, 5570],
            '전라선 KTX': [309, 1771, 1954, 2244, 3146, 3945, 5766],
            '동해선 KTX': [np.nan,np.nan, np.nan, np.nan, 2395, 3786, 6667]}
col_list = ['경부선 KTX','호남선 KTX','경전선 KTX','전라선 KTX','동해선 KTX']
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']

df_KTX=pd.DataFrame(KTX_data, index=index_list, columns=col_list)
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [54]:
df_KTX.index

Index(['2011', '2012', '2013', '2014', '2015', '2016', '2017'], dtype='object')

In [55]:
df_KTX.columns

Index(['경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX'], dtype='object')

In [56]:
df_KTX.values

array([[39060.,  7313.,  3627.,   309.,    nan],
       [39896.,  6967.,  4168.,  1771.,    nan],
       [42005.,  6873.,  4088.,  1954.,    nan],
       [43621.,  6626.,  4424.,  2244.,    nan],
       [41702.,  8675.,  4606.,  3146.,  2395.],
       [41266., 10622.,  4984.,  3945.,  3786.],
       [32427.,  9228.,  5570.,  5766.,  6667.]])

In [57]:
df_KTX.head()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

In [58]:
df_KTX.tail()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

__데이터 프레임 변수 바로 앞에 [] 가 나오면 안에는 컬럼명이 들어가야 한다.
(예외 : 인덱스 번호를 넣을수도 있다)__

__데이터 프레임 변수 에서 인덱스 이름로 할려면 .loc()을 써야 한다__

In [59]:
df_KTX[2:]  # 원하는 연속된 구간의 행번호 지정해서 출력하기. 행의 위치는 0부터 시작한다.

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [61]:
df_KTX[1 :2] # 행 하나를 선택하더라도 슬라이싱 방식으로 지정해야 한다.

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    39896     6967     4168     1771      NaN

In [66]:
# 데이터 생성시 index를 지정했다면 , 인덱스 이름을 지정해서 행을 선택 할수도 있다. 

df_KTX.loc["2011"] #인덱스 이름이 들어간다.

경부선 KTX    39060.0
호남선 KTX     7313.0
경전선 KTX     3627.0
전라선 KTX      309.0
동해선 KTX        NaN
Name: 2011, dtype: float64

In [63]:
df_KTX.loc["2011":'2014'] # 인덱스 구간 지정 가능.  ---->>> 마지막 인덱스가 포함되어 출력된다!!!!!!!!!

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN

In [68]:
# 하나의 열 선택하기
df_KTX["경부선 KTX"]  # 열을 선택할려면 컬럼 이름이 들어간다.

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부선 KTX, dtype: int64

In [70]:
df_KTX['경부선 KTX']['2012':'2014']  # 하나의 컬럼을 선택하고 해당되는 열 범위 지정하기.

2012    39896
2013    42005
2014    43621
Name: 경부선 KTX, dtype: int64

In [72]:
df_KTX['경부선 KTX'][1:4] # 인덱스 번호로 호출할수도 있다.

2012    39896
2013    42005
2014    43621
Name: 경부선 KTX, dtype: int64

In [79]:
# 하나의 원소만 선택하기
print(df_KTX.loc['2013']['경부선 KTX'])
print()
print(df_KTX.loc['2013','경부선 KTX'])
print()
print(df_KTX['경부선 KTX']['2013'])
print()
print(df_KTX['경부선 KTX'][2]) # 인덱스 번호.
print()
print(df_KTX['경부선 KTX'].loc['2013'])
print()

42005.0

42005

42005

42005

42005

In [80]:
# 데이터의 행과 열을 바꾸기 (전치 : transpose)

df_KTX.T

            2011     2012     2013     2014     2015     2016     2017
경부선 KTX  39060.0  39896.0  42005.0  43621.0  41702.0  41266.0  32427.0
호남선 KTX   7313.0   6967.0   6873.0   6626.0   8675.0  10622.0   9228.0
경전선 KTX   3627.0   4168.0   4088.0   4424.0   4606.0   4984.0   5570.0
전라선 KTX    309.0   1771.0   1954.0   2244.0   3146.0   3945.0   5766.0
동해선 KTX      NaN      NaN      NaN      NaN   2395.0   3786.0   6667.0

In [84]:
# 열 순서 바꾸기
df_KTX[['호남선 KTX','경부선 KTX','전라선 KTX','동해선 KTX','경전선 KTX']]  # 대괄호 해주어야 한다.

      호남선 KTX  경부선 KTX  전라선 KTX  동해선 KTX  경전선 KTX
2011     7313    39060      309      NaN     3627
2012     6967    39896     1771      NaN     4168
2013     6873    42005     1954      NaN     4088
2014     6626    43621     2244      NaN     4424
2015     8675    41702     3146   2395.0     4606
2016    10622    41266     3945   3786.0     4984
2017     9228    32427     5766   6667.0     5570

#### 데이터 통합하기 
- 두개의 데이터를 하나로 통합하기.
- 1. 세로로 증가 하기
- 2. 가로로 증가하기
- 3. 특정 열을 기준으로 증가하기

In [88]:
# 세로 방향으로 통합하기 : append 사용  //  실행하면 복사본이 반환된다. 

df1 = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]})
df1

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99

In [89]:
df2 = pd.DataFrame({'Class1': [87, 89],
                    'Class2': [85, 90]})
df2

   Class1  Class2
0      87      85
1      89      90

In [92]:
df1.append(df2 , ignore_index=True)  # 인덱스 초기화 해서 처음부터 매기기

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

In [97]:
# 컬럼이 같지 않은 데이터를 추가한다면 없는 부분은 nan으로 채워지게 된다. 
df3= pd.DataFrame({"Class1":[96,34]})
df2.append(df3,ignore_index=True)

   Class1  Class2
0      87    85.0
1      89    90.0
2      96     NaN
3      34     NaN

In [102]:
# 가로 방향으로 통합하기  :join 사용하기 

df4=pd.DataFrame({'Class3':[94,56,98]})
df4

df1.join(df4)

   Class1  Class2  Class3
0      95      91    94.0
1      92      93    56.0
2      98      97    98.0
3     100      99     NaN

In [107]:
# 인덱스 라벨을 지정한 경우에도 인덱스가 같으면 join으로 가능하다. 
index_label = ['a','b','c','d']

df1a = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]}, index= index_label)
df4a = pd.DataFrame({'Class3': [93, 91, 95, 98]}, index=index_label)   # 인덱스 수와 밸류 개수가 같아야 한다. 아니면 에러

df1a.join(df4a)

   Class1  Class2  Class3
a      95      91      93
b      92      93      91
c      98      97      95
d     100      99      98

In [114]:
df5 = pd.DataFrame({'Class4': [93,  98]}) # 빈값은 넌으로 들어간다.

df1.join(df5)

   Class1  Class2  Class4
0      95      91    93.0
1      92      93    98.0
2      98      97     NaN
3     100      99     NaN

In [115]:
# 특정 열을 기준으로 통합하기 : merge 사용  / 두개의 데이터프레임의 공통된 열이 있다면 이를 기준으로 통합한다. 

df_A_B = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'],
                       '제품A': [100, 150, 200, 130],
                       '제품B': [90, 110, 140, 170]})
df_A_B

  판매월  제품A  제품B
0  1월  100   90
1  2월  150  110
2  3월  200  140
3  4월  130  170

In [116]:
df_C_D = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'],
                       '제품C': [112, 141, 203, 134],
                       '제품D': [90, 110, 140, 170]})
df_C_D

  판매월  제품C  제품D
0  1월  112   90
1  2월  141  110
2  3월  203  140
3  4월  134  170

In [118]:
df_A_B.merge(df_C_D)

  판매월  제품A  제품B  제품C  제품D
0  1월  100   90  112   90
1  2월  150  110  141  110
2  3월  200  140  203  140
3  4월  130  170  134  170

In [119]:
# 특정열을 기준으로 일부만 공통된 값을 갖는 경우 : 선택인자를 지정해야 한다. 


df_left = pd.DataFrame({'key':['A','B','C'], 'left': [1, 2, 3]})
df_left

  key  left
0   A     1
1   B     2
2   C     3

In [120]:
df_right = pd.DataFrame({'key':['A','B','D'], 'right': [4, 5, 6]})
df_right

  key  right
0   A      4
1   B      5
2   D      6

In [122]:
### AB는 공통으로 있고 C ,D는 따고 가지고 있다.
df_left.merge(df_right,how='left',on='key')

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [123]:
df_left.merge(df_right,how='right',on='key')

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [124]:
df_left.merge(df_right,how='outer',on='key')

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

In [125]:
df_left.merge(df_right,how='inner',on='key')  # 공통 항목만 선택함.

  key  left  right
0   A     1      4
1   B     2      5

### 데이터 파일을 읽고 쓰기
-  데이터 파일을 데이터 프레임 형식으로 읽어 오기 
- 데이터 프레임을 표형식으로 파일에 저장하기.

In [128]:
pd.read_csv("sea_rain1.csv")

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

- 표 형식의 데이터를 파일로 쓰기

In [3]:
df_WH = pd.DataFrame({'Weight':[62, 67, 55, 74],
                      'Height':[165, 177, 160, 180]},
                       index=['ID_1', 'ID_2', 'ID_3', 'ID_4'])
df_WH.index.name = 'User'
df_WH

      Weight  Height
User
ID_1      62     165
ID_2      67     177
ID_3      55     160
ID_4      74     180

In [4]:
# 체질량 지수를 구해 데이터 프레임에 추가하자.
bm1= df_WH['Weight']/(df_WH["Height"])**2  # 체질량 구하는 공식
bm1

User
ID_1    0.002277
ID_2    0.002139
ID_3    0.002148
ID_4    0.002284
dtype: float64

In [7]:
df_WH["BMI"]=bm1  # 데이터프레임 열추가. 
df_WH

      Weight  Height       BMI
User
ID_1      62     165  0.002277
ID_2      67     177  0.002139
ID_3      55     160  0.002148
ID_4      74     180  0.002284

In [8]:
# csv 파일로 저장하기 
df_WH.to_csv("sava_test.csv")

In [11]:
!type C:\Users\student\2020_python\sava_test.csv

User,Weight,Height,BMI
ID_1,62,165,0.0022773186409550047
ID_2,67,177,0.002138593635289987
ID_3,55,160,0.0021484375
ID_4,74,180,0.002283950617283951

In [12]:
# 옵션 지정해서 저장하기
df_pr = pd.DataFrame({'판매가격':[2000, 3000, 5000, 10000],
                       '판매량':[32, 53, 40, 25]},
                       index=['P1001', 'P1002', 'P1003', 'P1004'])
df_pr.index.name = '제품번호'
df_pr

        판매가격  판매량
제품번호
P1001   2000   32
P1002   3000   53
P1003   5000   40
P1004  10000   25

In [17]:
df_pr.to_csv("sava_test2.csv",sep=' ',encoding='cp949')

In [18]:
!type C:\Users\student\2020_python\sava_test2.csv

제품번호 판매가격 판매량
P1001 2000 32
P1002 3000 53
P1003 5000 40
P1004 10000 25